'''
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить, к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и dict
'''
try:
    n_month = int(input("Введите число от 1 до 12: "))
except:
    print ('Это не целое число')
    exit(0)
list_sesons = ["Зима", "Весна", "Лето", "Осень"]
if (n_month == 12) or (1 <= n_month <=2):
    print("По списку:", list_sesons[0])
elif  3 <= n_month <= 5:
    print("По списку:", list_sesons[1])
elif 6 <= n_month <= 8:
    print("По списку:", list_sesons[2])
elif 9 <= n_month <= 11:
    print("По списку:", list_sesons[3])

dict_sessons = {12: "Зима", 1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень"}
print("По словарю: ", dict_sessons.get(n_month))