'''
1. Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в переменные,
затем выведите на экран.
'''
name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")
curse_gb = input("Введите название курса на GB: ")
avg_score = input("Введите средний бал на обучении GB: ")
print(f"Анкета соискателя вакансии\nИмя: {name}\nВозраст: {age}\nНазвание пройденного курса GB: {curse_gb}\nСредний бал на курсе: {avg_score}")